In [8]:
import pandas  as pd

In [11]:
df=pd.read_csv(r"C:/Users/Abid Unnisa/Desktop/police killings new.csv")

In [13]:
#view first 5 rows

df.head()

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera,longitude,latitude,is_geocoding_exact
0,3,Tim Elliot,02-01-2015,shot,gun,53.0,M,A,Shelton,WA,True,attack,Not fleeing,False,-123.122,47.247,True
1,4,Lewis Lee Lembke,02-01-2015,shot,gun,47.0,M,W,Aloha,OR,False,attack,Not fleeing,False,-122.892,45.487,True
2,5,John Paul Quintero,03-01-2015,shot and Tasered,unarmed,23.0,M,H,Wichita,KS,False,other,Not fleeing,False,-97.281,37.695,True
3,8,Matthew Hoffman,04-01-2015,shot,toy weapon,32.0,M,W,San Francisco,CA,True,attack,Not fleeing,False,-122.422,37.763,True
4,9,Michael Rodriguez,04-01-2015,shot,nail gun,39.0,M,H,Evans,CO,False,attack,Not fleeing,False,-104.692,40.384,True

In [15]:
#view shape
df.shape

(5645, 17)

In [17]:
#view columns

df.columns

Index(['id', 'name', 'date', 'manner_of_death', 'armed', 'age', 'gender',
       'race', 'city', 'state', 'signs_of_mental_illness', 'threat_level',
       'flee', 'body_camera', 'longitude', 'latitude', 'is_geocoding_exact'],
      dtype='object')

In [24]:
#view the following columns 

#1.state
#2.date
#3.id

df.state

0       WA
1       OR
2       KS
3       CA
4       CO
        ..
5640    PA
5641    UT
5642    CO
5643    TX
5644    FL
Name: state, Length: 5645, dtype: object

In [22]:
df.date

0       02-01-2015
1       02-01-2015
2       03-01-2015
3       04-01-2015
4       04-01-2015
           ...
5640    13-09-2020
5641    15-09-2020
5642    15-09-2020
5643    15-09-2020
5644    17-09-2020
Name: date, Length: 5645, dtype: object

In [25]:
df.id

0          3
1          4
2          5
3          8
4          9
        ...
5640    6157
5641    6171
5642    6172
5643    6173
5644    6174
Name: id, Length: 5645, dtype: int64

In [28]:
#clean the dataset of column 'armed' and replace the No values with 'other'

df['armed'].fillna(value='other', inplace=True)
df.armed

0              gun
1              gun
2          unarmed
3       toy weapon
4         nail gun
           ...
5640         knife
5641           gun
5642           gun
5643           gun
5644        shovel
Name: armed, Length: 5645, dtype: object

In [33]:
#view the shape

df.shape

#drop the index named as 'armed'

df1=df.drop([df.index[20]])

df1.shape

(5644, 17)

In [36]:
#rename the columns

df=df.rename(columns={'id' : 'ID'})
df.ID

0          3
1          4
2          5
3          8
4          9
        ...
5640    6157
5641    6171
5642    6172
5643    6173
5644    6174
Name: ID, Length: 5645, dtype: int64

In [40]:
#now let us create our own datasets and perform the operations

students = [ ('Jack', 34, 'Sydney') ,

             ('Riti', 31, 'Delhi' ) ,

             ('Aadi', 16, 'New York') ,

             ('Riti', 32, 'Delhi' ) ,

             ('Riti', 33, 'Delhi' ) ,

             ('Riti', 35, 'Mumbai' ),

             ('Ajay', 21, 'Hyderabad')

             ]

#create a dataframe object
df3=pd.DataFrame(students,columns=['Name','Marks','City'], index=['b','a','f','e','d','c','g'])
df3

   Name  Marks       City
b  Jack     34     Sydney
a  Riti     31      Delhi
f  Aadi     16   New York
e  Riti     32      Delhi
d  Riti     33      Delhi
c  Riti     35     Mumbai
g  Ajay     21  Hyderabad

In [43]:
#observe the difference between below 3 operations on sort function

#let us perform the sort by index
df3.sort_index()

   Name  Marks       City
a  Riti     31      Delhi
b  Jack     34     Sydney
c  Riti     35     Mumbai
d  Riti     33      Delhi
e  Riti     32      Delhi
f  Aadi     16   New York
g  Ajay     21  Hyderabad

In [45]:
#sorting in ascending order

df3.sort_index(axis=0, level=None, ascending=True, inplace=False, kind='quicksort', na_position='last', sort_remaining=True)

   Name  Marks       City
a  Riti     31      Delhi
b  Jack     34     Sydney
c  Riti     35     Mumbai
d  Riti     33      Delhi
e  Riti     32      Delhi
f  Aadi     16   New York
g  Ajay     21  Hyderabad

In [47]:
#sorting in descending order

df3.sort_index(axis=0, level=None, ascending=False, inplace=False, kind='quicksort', na_position='last', sort_remaining=True)

   Name  Marks       City
g  Ajay     21  Hyderabad
f  Aadi     16   New York
e  Riti     32      Delhi
d  Riti     33      Delhi
c  Riti     35     Mumbai
b  Jack     34     Sydney
a  Riti     31      Delhi

In [50]:
#sort by column numbers
df3.sort_index(inplace=True, axis=1)
df3

        City  Marks  Name
b     Sydney     34  Jack
a      Delhi     31  Riti
f   New York     16  Aadi
e      Delhi     32  Riti
d      Delhi     33  Riti
c     Mumbai     35  Riti
g  Hyderabad     21  Ajay

In [53]:
#group by name

group_by_name=df3.groupby('Name')
group_by_name.size()

Name
Aadi    1
Ajay    1
Jack    1
Riti    4
dtype: int64